def check_triangle(a, b, c):
    # Проверка условия существования треугольника
    if a >= b + c or b >= a + c or c >= a + b:
        return "Треугольник с такими сторонами не существует."

    # Проверка сравнения длины каждой стороны с суммой двух других
    if a > b + c or b > a + c or c > a + b:
        return "Треугольник с такими сторонами не существует."

    # Определение типа треугольника
    if a == b == c:
        return "Треугольник является равносторонним."
    elif a == b or a == c or b == c:
        return "Треугольник является равнобедренным."
    else:
        return "Треугольник является разносторонним."

a = 5
b = 4
c = 6
result = check_triangle(a, b, c)
print(result)
