# В большой текстовой строке подсчитать количество встречаемых
# слов и вернуть 10 самых частых. Не учитывать знаки препинания
# и регистр символов. За основу возьмите любую статью
# из википедии или из документации к языку.

import re
from collections import Counter

def count_most_frequent_words(text, top_n=10):
    # Удалите знаки препинания и переведите в нижний регистр
    clean_text = re.sub(r'[^\w\s]', '', text.lower())

    # Разделить текст на слова
    words = clean_text.split()

    # Подсчитать количество вхождений каждого слова
    word_counts = Counter(words)

    # Получите N наиболее часто встречающихся слов
    most_frequent = word_counts.most_common(top_n)

    return most_frequent

article_text = """
    Статья — это жанр журналистики, в котором автор ставит задачу проанализировать общественные ситуации, процессы, явления, прежде всего с точки зрения закономерностей, лежащих в их основе. В статье автор рассматривает отдельные ситуации как часть более широкого явления. Автор аргументированно пишет о своей точке зрения.
    В статье выражается развернутая обстоятельная аргументированная концепция автора или редакции по поводу актуальной социологической проблемы. Также в статье журналист обязательно должен интерпретировать факты (это могут быть цифры, дополнительная информация, которая будет правильно расставлять акценты и ярко раскрывать суть вопроса).
"""

most_frequent_words = count_most_frequent_words(article_text)
print("Топ 10 популярных слов:")
for word, count in most_frequent_words:
    print(f"{word}: {count}")
