# Напишите функцию, которая принимает на вход строку - абсолютный путь до файла.
# Функция возвращает кортеж из трёх элементов: путь, имя файла, расширение файла.

def input_text(text):
    *path, file = text.rsplit("\\", 1)
    return *path, *file.split('.')


text = input("Введите путь к файлу: ")
print(input_text(text))

# мб как то проще можно
