# Напишите однострочный генератор словаря, который принимает
# на вход три списка одинаковой длины: имена str, ставка int, премия str с указанием процентов вида “10.25%”.
# В результате получаем словарь с именем в качестве ключа и суммой премии в качестве значения.
# Сумма рассчитывается как ставка умноженная на процент премии

names = ['Alice', 'Bob', 'Charlie']
rates = [100, 200, 150]
premiums = ['10.25%', '5%', '8.75%']

premium_dict = {name: rate * float(premium.strip('%')) / 100 for name, rate, premium in zip(names, rates, premiums)}

print(premium_dict)



